app/views/conversations/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  <% @messages.each do |message| %>
    <b><%= link_to User.find(message.user_id).name,User.find(message.user_id) %>: </b><%= message.content %><br>