app/views/users/show.html.erb

<h1><%= @user.name %>'s posts:</h1>
<% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1

    <p>Comments:</p><br>
    <% post.comments.each do |comment| %>
        <b><%= link_to User.find(comment.user_id).name,User.find(comment.user_id) %></b>: <br><%= comment.body %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1