app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", #<BigDecimal:35bea08,'0.1E1',9(36)>]]
---
    <%= post.body %>
    <p>Belongs to: <%= link_to User.find(post.user_id).name, User.find(post.user_id)  %></p><br><br>