app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  <%= @post.body %>
  <p>Belongs to: <%= link_to User.find(@post.user_id).name, User.find(@post.user_id)  %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
---
  <p>Comments:</p><br>
  <% @post.comments.each do |comment| %>