app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
    @comment.user_id = current_user.id
    @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["created_at", Thu, 11 Oct 2012 20:59:22 UTC +00:00], ["post_id", #<BigDecimal:2f68560,'0.3E1',9(36)>], ["updated_at", Thu, 11 Oct 2012 20:59:22 UTC +00:00], ["user_id", nil]]
UPDATE "comments" SET "body" = 'test comment #2', "post_id" = 3.0, "created_at" = '2012-10-12 00:57:58.132163', "updated_at" = '2012-10-12 00:57:58.132163', "user_id" = 1.0 WHERE "comments"."id" = 2

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]