app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    @conversations = Conversation.all
    @conversations.each do |conversation|
      conversation.name = ""
      conversation.users.split(",").each do |i|
        user = User.find(i.to_i)

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @conversation = Conversation.find(params[:id])
    if @conversation.users.split(",").include?(current_user.id.to_s)