app/controllers/messages_controller.rb

  def create
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.create(params[:message])
    @message.user_id = current_user.id
    @message.save
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "messages" ("content", "conversation_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", nil], ["conversation_id", 1], ["created_at", Mon, 15 Oct 2012 19:03:48 UTC +00:00], ["updated_at", Mon, 15 Oct 2012 19:03:48 UTC +00:00], ["user_id", nil]]
UPDATE "messages" SET "user_id" = 1, "updated_at" = '2012-10-15 19:03:48.574857' WHERE "messages"."id" = 3