app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Sample Body"], ["created_at", Thu, 11 Oct 2012 00:14:34 UTC +00:00], ["title", "Sample Title"], ["updated_at", Thu, 11 Oct 2012 00:14:34 UTC +00:00], ["user_id", nil]]
---
  def create
    @post = current_user.posts.create(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @post.destroy